# get_dummies

In [52]:
#import necessarylibrary
import numpy as np
import pandas as pd

In [13]:
#create a data frame with categorical variable
df=pd.DataFrame({'key':['a','a','b','c','b','c'],'data':range(6)})

In [14]:
#show the data frame
df

  key  data
0   a     0
1   a     1
2   b     2
3   c     3
4   b     4
5   c     5

In [15]:
#get dummies of the dataframe
dummies=pd.get_dummies(df['key'],prefix='key')

In [16]:
#dummies dataframe
dummies

   key_a  key_b  key_c
0      1      0      0
1      1      0      0
2      0      1      0
3      0      0      1
4      0      1      0
5      0      0      1

In [17]:
#data frame with dummies
dummies=pd.get_dummies(df[['key']])
df_with_dummy=df[['data']].join(dummies)
df_with_dummy

   data  key_a  key_b  key_c
0     0      1      0      0
1     1      1      0      0
2     2      0      1      0
3     3      0      0      1
4     4      0      1      0
5     5      0      0      1

# Problem arries when multiple categories.

In [23]:
# import our dataset
mname=['movies_id','title','genres']
movies=pd.read_table(r'C:\Users\Shubhamay\Downloads\ml-1m\ml-1m\movies.dat',
                     sep='::',header=None,names=mname)

C:\Users\Shubhamay\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

In [24]:
#to see our dataset
movies

,movies_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [29]:
#to see the unique value of genres
all_genres=[]
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres=pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [37]:
#create a zero_matrix
zero_matrics=np.zeros((len(movies),len(genres)))
dummies=pd.DataFrame(zero_matrics,columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [39]:
gen=movies.genres[0]
gen.split("|")

['Animation', "Children's", 'Comedy']

In [40]:
dummies.columns.get_indexer(gen.split("|"))

array([0, 1, 2], dtype=int64)

In [44]:
#create a dummies dataframe taking all the unique categories
for i,gen in enumerate(movies.genres):
    index=dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,index]=1

In [45]:
#to see the dummies dataframe
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [47]:
# to join dummies with our original dataframe
movie_windic=movies.join(dummies.add_prefix('genre_'))

In [48]:
#to see our dataframe after creating dummies
movie_windic

,movies_id,title,genres,genre_Animation,genre_Children's,genre_Comedy,genre_Adventure,genre_Fantasy,genre_Romance,genre_Drama,...,genre_Crime,genre_Thriller,genre_Horror,genre_Sci-Fi,genre_Documentary,genre_War,genre_Musical,genre_Mystery,genre_Film-Noir,genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [3]:
#taking random seed as for better control with our randomness
np.random.seed(123456)

In [5]:
#define value array
value=np.random.rand(20)
value

array([0.85289978, 0.23550748, 0.14622723, 0.58986877, 0.57401177,
       0.06126996, 0.590426  , 0.24534982, 0.34044494, 0.98472874,
       0.9195404 , 0.03777169, 0.86154929, 0.75356885, 0.40517876,
       0.34352588, 0.17091717, 0.39465901, 0.64166617, 0.27459243])

In [6]:
#define bin
bin=[0,0.2,0.4,0.6,0.8,1]

In [7]:
#cut our array according to bin
value_cut=pd.cut(value,bin)
value_cut

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.4, 0.6], (0.4, 0.6], ..., (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.6, 0.8], (0.2, 0.4]]
Length: 20
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [9]:
#get dummies of our cut array
dummies=pd.get_dummies(value_cut)
dummies

    (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0            0           0           0           0           1
1            0           1           0           0           0
2            1           0           0           0           0
3            0           0           1           0           0
4            0           0           1           0           0
5            1           0           0           0           0
6            0           0           1           0           0
7            0           1           0           0           0
8            0           1           0           0           0
9            0           0           0           0           1
10           0           0           0           0           1
11           1           0           0           0           0
12           0           0           0           0           1
13           0           0           0           1           0
14           0           0           1           0           0
15           0           1           0           0           0
16           1           0           0           0           0
17           0           1           0           0           0
18           0           0           0           1           0
19           0           1           0           0           0

# Handling with duplicate values

In [56]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [58]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [59]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [60]:
data['Y1']=range(7)

In [61]:
data

    k1  k2  Y1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [62]:
data.drop_duplicates('k1')

    k1  k2  Y1
0  one   1   0
1  two   1   1

In [63]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  Y1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# Mapping in DataFrame

In [82]:
df3=pd.DataFrame({'food':['potato','spark','audio','sarck','massroom',\
                          'chaman','cigarate'],'price':[4,3,4,6,4,2,4]})
df3

       food  price
0    potato      4
1     spark      3
2     audio      4
3     sarck      6
4  massroom      4
5    chaman      2
6  cigarate      4

In [83]:
type={'potato':'sabji','spark':'current','audio':'haearable',\
      'sarck':'fish','massroom':'amiba','chaman':'null','cigarate':'smooking'}

In [84]:
subdf=df3['food']

In [85]:
df3['Type']=subdf.map(type)

In [86]:
df3

       food  price       Type
0    potato      4      sabji
1     spark      3    current
2     audio      4  haearable
3     sarck      6       fish
4  massroom      4      amiba
5    chaman      2       null
6  cigarate      4   smooking

In [87]:
df3['food'].map(lambda x:type[x])

0        sabji
1      current
2    haearable
3         fish
4        amiba
5         null
6     smooking
Name: food, dtype: object

In [88]:
df3

       food  price       Type
0    potato      4      sabji
1     spark      3    current
2     audio      4  haearable
3     sarck      6       fish
4  massroom      4      amiba
5    chaman      2       null
6  cigarate      4   smooking

# Replace in Data Handling

In [91]:
dt=pd.Series([-1,999,5,6,999,1000,3])
dt

0      -1
1     999
2       5
3       6
4     999
5    1000
6       3
dtype: int64

In [93]:
dt.replace([999,1000],NA)

0   -1.0
1    NaN
2    5.0
3    6.0
4    NaN
5    NaN
6    3.0
dtype: float64

In [94]:
dt.replace([999,1000],[10,12])

0    -1
1    10
2     5
3     6
4    10
5    12
6     3
dtype: int64

# cut & qcut function in data cleaning

In [4]:
import pandas as pd
age=[21,22,25,27,21,16,35,40,42,25,26,28,9,61,56,37,45]
df=pd.cut(age,[0,25,40,50,70],labels=['young','young aged','middle age','old'])
df

[young, young, young, young aged, young, ..., young, old, old, young aged, middle age]
Length: 17
Categories (4, object): [young < young aged < middle age < old]

In [122]:
cats=pd.Series(cat)

In [15]:
import numpy as np
data=np.random.rand(20)

In [19]:
df1=pd.cut(data,4,precision=2)
df1.value_counts()

(0.012, 0.24]    1
(0.24, 0.47]     4
(0.47, 0.7]      8
(0.7, 0.93]      7
dtype: int64

In [25]:
df1=pd.qcut(data,5)
df1.value_counts()

(0.011800000000000001, 0.39]    4
(0.39, 0.576]                   4
(0.576, 0.673]                  4
(0.673, 0.758]                  4
(0.758, 0.935]                  4
dtype: int64

# Treating with outlier

In [53]:
data=np.random.randn(1000,4)
df1=pd.DataFrame(data)
df1.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.052721     0.022819     0.024457     0.075258
std       1.010480     0.981248     0.964994     1.013645
min      -2.896188    -2.748235    -2.838009    -3.088647
25%      -0.706548    -0.689739    -0.583566    -0.628590
50%      -0.051425    -0.006923     0.044207     0.054216
75%       0.643897     0.708582     0.688602     0.766462
max       2.911241     3.244358     3.221698     3.076411

In [54]:
col=df1[1]
col[np.abs(col)>3]

714    3.244358
893    3.060435
Name: 1, dtype: float64

In [55]:
#all the value greater than 3 or less than -3 is replace by 3 or -3 respectively
df1[np.abs(df1)>3]=np.sign(df1)*3

In [56]:
df1.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.052721     0.022514     0.024235     0.075270
std       1.010480     0.980289     0.964284     1.013149
min      -2.896188    -2.748235    -2.838009    -3.000000
25%      -0.706548    -0.689739    -0.583566    -0.628590
50%      -0.051425    -0.006923     0.044207     0.054216
75%       0.643897     0.708582     0.688602     0.766462
max       2.911241     3.000000     3.000000     3.000000

In [57]:
#sign function in dataframe
np.sign(df1)*5

       0    1    2    3
0    5.0  5.0 -5.0  5.0
1    5.0 -5.0  5.0  5.0
2   -5.0 -5.0  5.0 -5.0
3    5.0  5.0  5.0  5.0
4    5.0  5.0  5.0 -5.0
..   ...  ...  ...  ...
995  5.0 -5.0  5.0  5.0
996  5.0  5.0  5.0  5.0
997 -5.0 -5.0  5.0  5.0
998 -5.0 -5.0 -5.0 -5.0
999  5.0  5.0  5.0 -5.0

[1000 rows x 4 columns]

# Permutatio in DataFrame

In [58]:
df4=pd.DataFrame(np.arange(20).reshape(5,4))

In [59]:
df4

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [60]:
sampler=np.random.permutation(5)

In [61]:
sampler

array([4, 2, 3, 1, 0])

In [62]:
df4.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3

In [63]:
df4.sample(n=10,replace=True)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15
3  12  13  14  15

In [64]:
df5=pd.Series([5,7,-1,6,4])
choice=df5.sample(n=10,replace=True)

In [65]:
df5

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [66]:
choice

4    4
4    4
2   -1
2   -1
2   -1
0    5
4    4
0    5
0    5
0    5
dtype: int64

# String Manipulation

In [13]:
#split string 
val='a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [15]:
# split using list comprehension
#here strip function used to remove the unwanted space
new_val=[x.strip() for x in val.split(',')]
new_val
#from the new _val you can find the function of strip

['a', 'b', 'guido']

In [16]:
#join of new_val by ::
'::'.join(new_val)

'a::b::guido'

In [19]:
#to check  any value is present or not 
'guido' in val

True

In [20]:
# to find index of any element present in the string
val.index(',')

1

In [21]:
#alternative way to find
val.find(',')

1

# Difference between index and find function

In [24]:
val.find(':')

-1

In [25]:
val.index(':')

ValueError: substring not found

In [26]:
#return the count of occurre of a perticular string
val.count(',')

2

In [29]:
#Replace function in string
val.replace(',','::')

'a::b:: guido'

In [30]:
val.replace(',','')

'ab guido'

# Regular Expression

In [1]:
#regular expression one or more whitespace with '\s+'
import re
text='babool   mar  tis\t  ke liye'
re.split('\s+',text)

['babool', 'mar', 'tis', 'ke', 'liye']

In [36]:
#Regular expression first compile
reg=re.compile('\s+')
#then split the text
reg.split(text)

['babool', 'mar', 'tis', 'ke', 'liye']

In [37]:
#you wanted to find the regex matching the pattern
reg.findall(text)

['   ', '  ', '\t  ', ' ']

In [3]:
re.sub(r'[ad]', '*' ,'[abcde]')

'[*bc*e]'

In [4]:
#if a,b,c fen it is followed by 1,2,3 respectively then it is replace by asterisk
re.sub(r'[abc][123]','*','a1+b2+c5+x2')

'*+*+c5+x2'

In [5]:
# . means any one character
re.sub(r'A.B','*','AxB,AsB,A22B,A$B')

'*,*,A22B,*'

In [7]:
#replace any number of b followed by A
re.sub(r'AB+','*','ABB ABC AC ABBBBBBC')

'* *C AC *C'

In [9]:
#it replace three to six B followed by A
re.sub('AB{3,6}','*','AB ABBB ABBBBB ABBBBBBBBBBC')

'AB * * *BBBBC'

In [11]:
#it replace three number of B followed by A
re.sub('AB{3,6}?','*','ABB ABBBB ABBB ABBBBBBBB ABBBBBB')

'ABB *B * *BBBBB *BBB'

In [13]:
#it replace abc or xyz
re.sub('abc|xyz','*','abcxyz123def')

'**123def'

In [16]:
#it replace abc or xyz
re.sub('abc|xyz','*','abcxayz123deyf')

'*xayz123deyf'

In [14]:
#it replace any of a,b,c or x,y,z
re.sub('[abc]|[xyz]','*','abcx3yz123deaf')

'****3**123de*f'

In [18]:
#it findall any of a,b,c or x,y,z
re.findall('[abc]|[xyz]','abcx3yz123deaf')

['a', 'b', 'c', 'x', 'y', 'z', 'a']

In [19]:
#replace first occurance if combination is abc
re.sub('^abc','*','abccdefaabctprabc')

'*cdefaabctprabc'

In [21]:
#replace first occurance if a or b or c
re.sub('^[abc]','*','abccdefaabctprabc')

'*bccdefaabctprabc'

In [20]:
#replace  occurance other than abc
re.sub('[^abc]','*','abccdefaabctprabc')

'abcc***aabc***abc'

In [22]:
#replace last occurance
re.sub('abc$','*','abcabcdefabc')

'abcabcdef*'

In [23]:
#it replace AB+
re.sub('AB\+','*','ABAB+C')

'AB*C'

In [24]:
#replace any degit
re.sub('\d','*','3 + 4       =7')

'* + *       =*'

In [25]:
#replace any  non degit
re.sub('\D','*','3 + 4       =7')

'3***4********7'

In [27]:
# replace any letter or number
re.sub('\w','*','you should not hav2e to gully#')

'*** ****** *** ***** ** *****#'

In [28]:
#replace any thing else other than a letter and a number
re.sub('\W','*','you should not hav2e to gully#')

'you*should*not*hav2e*to*gully*'

In [29]:
#replace any white space
re.sub('\s','*','you should not hav2e to gully#')

'you*should*not*hav2e*to*gully#'

In [30]:
#replace any non whitespace
re.sub('\S','*','you should not hav2e to gully#')

'*** ****** *** ***** ** ******'

In [37]:
#replace the only followed by cat
re.sub('the(?= cat)','*','the dog and the cat')

'the dog and * cat'

In [38]:
#the only difference is that here we not provide the space
re.sub('the(?=cat)','*','the dog and the cat')

'the dog and the cat'

In [39]:
#replace the if proceed by a space
re.sub('(?<= )the','*','Athence is the capital of greek and lathe')

'Athence is * capital of greek and lathe'

In [40]:
#alternative way
re.sub('the(?= )','*','Athence is the capital of greek and lathe')

'Athence is * capital of greek and lathe'

In [41]:
#replace the if it is not followed by any character or number
re.sub('(?<!\w)[Tt]he(?!\w)','*','The Mahabharata is a holy book the of India')

'* Mahabharata is a holy book * of India'

In [42]:
#Code   Description
#(?=)   matches only if followed by
#(?!)   matches only if not followed by
#(?<=)   matches only if preceded by
#(?<!)   matches only if not preceded by

In [43]:
#become the caseinsensitive
re.sub('(?i)ab','*','ab AB')

'* *'

In [44]:
#take new line character and allow comment
patter=r"""(?x)[AB]\d+ #Match A,Bfollowed by some digit
                [CD]\d+  # MatchC,D followed by some digit"""
print(re.sub(patter,'*','A9C2B3 and A2B5C6'))

*B3 and A2*

In [45]:
#count key determine how many match we have to find
re.sub('a','*','abababab',count=2)

'*b*babab'

In [47]:
#find all the A or B followed by numerical number
re.findall('[AB]\d+','AB2+AB9+AB6')

['B2', 'B9', 'B6']

In [48]:
#find the all combination of AB followed by numerical number
re.findall('AB\d+','AB2+AB9+AB6')

['AB2', 'AB9', 'AB6']

In [50]:
#split by regular expression
re.split('\+|\-|\=','3x+4y-5z=12')

['3x', '4y', '5z', '12']

In [51]:
# match and search both are help ful in regular expreesion to find if there is any matching pattern or not
#but only difference is that match function match the substring only biginning of the string
#where as search match the substring through the string
if re.match('ZZZ','abcZZZyz'):
    print('Match  found at the biginning of the string ')
else:
    print('Match not found at the biginning of the string')

Match not found at the biginning of the string

In [53]:
if re.search('ZZZ','abcZZZyz'):
    print('Match  found in the string ')
else:
    print('Match not found in  string')

Match  found in the string

In [61]:
#group in regular expression
a=re.search('([ABC])(\d)','= A3+B6+C8')
print(a.group())
print(a.group(1))
print(a.group(2))

A3
A
3

In [66]:
#find all in regular expression
re.findall('[ABC]\d','= A3+B6+C8')

['A3', 'B6', 'C8']

In [68]:
#find all in regular expression
a=re.findall('([ABC])(\d)','= A3+B6+C8')
a

[('A', '3'), ('B', '6'), ('C', '8')]

In [70]:
#finditer and group in the regular expression
for s in  re.finditer('([AB])(\d)','A4+B6'):
    print(s.group(1))

A
B

In [71]:
#finditer and group in the regular expression
for s in  re.finditer('([AB])(\d)','A4+B6'):
    print(s.group(2))

4
6

In [72]:
#finditer and group in the regular expression
for s in  re.finditer('([AB])(\d)','A4+B6'):
    print(s.group())

A4
B6

In [73]:
#compile the regular expression and substitute text
pattern=re.compile('[AB]\d+')
pattern.sub('*','A3+B4')

'*+*'

In [74]:
pattern.sub('x','A3+B6')

'x+x'

In [6]:
import re
d={'jan':1,'feb':2,'march':3,'april':4,'may':5,'june':6\
  ,'july':7,'aug':8,'sep':9,'oct':10,'nov':11,'dec':12}
pattern=r"([A-Za-z]+)\.?\s*(\d{1,2})\,?\s*(\d{4})"
date=input('Enter the date.')
m=re.findall(pattern,date)
m

Enter the date.feb. 6,2016

[('feb', '6', '2016')]

In [12]:
import re
d={'jan':1,'feb':2,'march':3,'april':4,'may':5,'june':6\
  ,'july':7,'aug':8,'sep':9,'oct':10,'nov':11,'dec':12}
pattern=r"([A-Za-z]+)\.?\s*(\d{1,2})\,?\s*(\d{4})"
date=input('Enter the date.')
m=re.match(pattern,date)
m.group(3)

Enter the date.feb. 6,2016

'2016'

In [13]:
import re
d={'jan':1,'feb':2,'march':3,'april':4,'may':5,'june':6\
  ,'july':7,'aug':8,'sep':9,'oct':10,'nov':11,'dec':12}
pattern=r"([A-Za-z]+)\.?\s*(\d{1,2})\,?\s*(\d{4})"
date=input('Enter the date.')
m=re.match(pattern,date)
m.group(2)

Enter the date.feb. 6,2016

'6'

In [14]:
import re
d={'jan':1,'feb':2,'march':3,'april':4,'may':5,'june':6\
  ,'july':7,'aug':8,'sep':9,'oct':10,'nov':11,'dec':12}
pattern=r"([A-Za-z]+)\.?\s*(\d{1,2})\,?\s*(\d{4})"
date=input('Enter the date.')
m=re.match(pattern,date)
m.group(2)

Enter the date.feb. 6,2016

'6'

In [15]:
#using regex convert string date to numerical date
import re
d={'jan':1,'feb':2,'march':3,'april':4,'may':5,'june':6\
  ,'july':7,'aug':8,'sep':9,'oct':10,'nov':11,'dec':12}
pattern=r"([A-Za-z]+)\.?\s*(\d{1,2})\,?\s*(\d{4})"
date=input('Enter the date.')
m=re.match(pattern,date)
print('{}/{}/{}'.format(d[m.group(1).lower()[:3]],m.group(2),m.group(3)[-2:]))

Enter the date.feb. 6,2016
2/6/16

In [34]:
#find email using regex
text="""Shubha shubha@gmail.com
Suvo shubhamay@google.com
Suvam shubhara@yahoo.in"""
pattern=r'[A-Z0-9a-z._%+-]+@[A-Z0-9a-z.-]+\.[A-Za-z]{2,4}'
re.findall(pattern,text)

['shubha@gmail.com', 'shubhamay@google.com', 'shubhara@yahoo.in']

In [35]:
#search object tell us start of the pattern in regex
m=re.search(pattern,text)
m

In [37]:
#in match object show us None as it only match the first substring of the text
print(regex.match(text))

None

In [38]:
# eplace all email with EMAIL
regex.sub('EMAIL',text)

'Shubha EMAIL\nSuvo EMAIL\nSuvam EMAIL'

In [39]:
# eplace all email with EMAIL
print(regex.sub('EMAIL',text))

Shubha EMAIL
Suvo EMAIL
Suvam EMAIL

In [47]:
#group in regex
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
reg=re.compile(pattern,flags=re.IGNORECASE)
m=reg.match('shubh@gmail.com')
m.groups()

('shubh', 'gmail', 'com')

In [48]:
reg.findall(text)

[('shubha', 'gmail', 'com'),
 ('shubhamay', 'google', 'com'),
 ('shubhara', 'yahoo', 'in')]

In [50]:
print(reg.sub(r'username: \1,domain: \2,suffix:   \3',text))

Shubha username: shubha,domain: gmail,suffix:   com
Suvo username: shubhamay,domain: google,suffix:   com
Suvam username: shubhara,domain: yahoo,suffix:   in